{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "LSTM", "config": {"bias_regularizer": null, "dtype": "float32", "go_backwards": false, "dropout": 0.0, "activity_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "kernel_regularizer": null, "units": 128, "kernel_constraint": null, "trainable": true, "stateful": false, "unit_forget_bias": true, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "implementation": 1, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_dropout": 0.0, "activation": "tanh", "unroll": false, "use_bias": true, "return_sequences": false, "batch_input_shape": [null, 30, 61]}}, {"class_name": "Dense", "config": {"units": 61, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_regularizer": null, "use_bias": true}}], "name": "sequential_1"}}